{
    "runtime": 125,
    "raw_body": "Brief Summary\n\n\tIn 2013 the craziest anthology ever created was released to an unsuspecting public. It immediately divided audiences. Some claimed it was a much-needed adrenaline shot to the heart of genre film, while others claimed it was reprehensible and the death knell of cinema as we know it.\n\n\tIn 2014 it’s happening again. This time with an all-new line-up of international directors. Twenty-six NEW directors. Twenty-six NEW ways to die.\n\nFull Description\n\n\tABCs OF DEATH 2 is the follow-up to the most ambitious anthology film ever conceived with productions spanning from Nigeria to UK to Brazil and everywhere in between. It features segments directed by over two dozen of the world's leading talents in contemporary genre film. Inspired by children’s educational books, the motion picture is comprised of twenty-six individual chapters; each helmed by a different director assigned a letter of the alphabet.  The directors were then given free reign in choosing a word to create a story involving death. Provocative, shocking, funny and at times confrontational, ABCs OF DEATH 2 is another global celebration of next generation genre filmmaking.\n\n\tAfter it’s release on home-video and especially Netflix, the first film evolved into the equivalent of a celluloid boogeyman with viewers daring each other via social media to check out the film. Others chose to play drinking games while watching with participants trying to guess what each letter stood for.\n\n\tWe sincerely hope ABCs OF DEATH 2 is as much as a raucous party as the first film proved to be with audiences around the world.\n\n\tAdditional Credits:\n\tJeremy Gillespie (Segment Writer)\n\tShannon Hanmer (Segment Producer)\n\tPeter Katz (Segment Producer)\n\tPeter Kuplowsky (Segment Producer)\n\tLauren Molina (Segment Writer, Producer)\n\tNicholas Musurca (Segment Producer)\n\tAndy Starke (Segment Producer)\n\tDon Le (Segment Producer)\n\tPat Daniel (Segment Actor)\n\tTristan Risk (Segment Actor)\n\tClaudia Calviño (Segment Executive Producer)\n\tMariana Ramos (Segment Production Coordinator)",
    "year": 2014,
    "directors": [
        "Larry Fessenden",
        "Todd Rohal",
        "Marvin Kren",
        "Jim Hosking",
        "Julien Maury",
        "Alexandre Bustillo",
        "Julian Gilbey",
        "Soichi Umezawa",
        "Lancelot Imasuen",
        "Jerome Sable",
        "Robert Boocheck",
        "Aharon Keshales",
        "Navot Papushado",
        "Bill Plympton",
        "Rodney Ascher",
        "Erik Matti",
        "Steven Kostanski",
        "E.L. Katz",
        "Julian Barratt",
        "Hajime Ohata",
        "Vincenzo Natali",
        "Chris Nash",
        "Jen Soska",
        "Sylvia Soska",
        "Robert Morgan",
        "Kristina Buožytė",
        "Bruno Samper",
        "Alejandro Brugués",
        "Dennison Ramalho",
        "Juan Martínez Moreno"
    ],
    "title": "ABCs of Death 2",
    "country": "United States"
}