{
    "runtime": 153,
    "raw_body": "Brief Summary\n\n\tMystery abounds in this fractured gangster story from Karnataka, India. Shades of SCARFACE, PULP FICTION and RASHOMON color Rakshit Shetty's entrancing story of good, evil and something else...\n\nFull Description\n\n\tIntrepid reporter Regina serves as our proxy in director Rakshit Shetty's epic story of love, violence, jealousy and longing set in the seaside city of Malpe, India. As Regina attempts to put together a complicated story for her readers, Shetty's viewers are taken on a whirlwind journey through the Karnataka underworld, and introduced to the vividly written and realized characters who make up its inhabitants. Director Shetty deftly hides the focus of the story while managing to engage the audience in the lives of various big and small time hoods, nobodies in love, and a vivid cast of characters all in need of anything to make their lives make sense.\n\n\tA wonderfully vibrant and engaging Indian take on the classic non-linear crime story, AS SEEN BY THE REST is both an easily identifiable offspring of its greatest influences and a creation all its own. With explicit references to well-known crime stories like SCARFACE and PULP FICTION, the film functions more like a retelling of RASHOMON, bathed in the colorful expressions of Karnataka's religious fervor during the festival of Sri Krishna Janmaashtami. The city is drenched in the colors of celebration, but a blood-red stain leaves its residents wondering what happened and who is to blame.\n\n\tThis is a milestone for Karnataka cinema, one of the first films in the Kannada language to break out from Bengaluru theaters to the world outside. Rakshit Shetty presents us with a film that is never less than rapturous in its embrace of cinema and its effect on the collective consciousness of its fans. In addition to directing the film, Shetty also wrote and starred in it, alongside a number of other vibrant and colorful characters.(Josh Hurtado)",
    "year": 2014,
    "directors": [
        "Rakshit Shetty"
    ],
    "title": "AS SEEN BY THE REST (Ulidavaru Kandante)",
    "country": "India"
}