{
    "runtime": 107,
    "raw_body": "Brief Summary\n\n\tMark Hartley brings his singular documentary style to the story of Menahem Golan and Yoram Globus, the trailblazers behind exploitation powerhouse studio Cannon Films.\n\nFull Description\n\n\tCousins Menahem Golan and Yoram Globus helped to create the modern Israeli film industry with titles such as OPERATION THUNDERBOLT and LEMON POPSICLE (later remade as THE LAST AMERICAN VIRGIN). During the ‘80s, Golan and Globus set up shop in Hollywood by purchasing The Cannon Group. Dismal titles such as THE APPLE quickly gained Cannon Group a reputation as purveyors of rotten movies. Despite the criticism, the pair kept pushing forward. The persistence paid off when Cannon released BREAKIN’, which was rushed through production in order to beat its East Coast rival BEAT STREET. Bolstered by that film’s success, Golan and Globus went on to produce a stunningly eclectic array of films, ranging from straight-up genre (INVASION USA; DEATH WISH 3; LIFEFORCE) to more esteemed fare (KING LEAR; BARFLY; LOVE STREAMS). A combination of commercial misfires and poorly executed business moves in the ‘90s led to the company’s collapse, but the Cannon legacy remains strong in the hearts of many fans.\n\n\tAs demonstrated by NOT QUITE HOLLYWOOD and MACHETE MAIDENS UNLEASHED, Mark Hartley has one of the most interesting and identifiable styles of any documentary filmmaker currently in the business. ELECTRIC BOOGALOO: THE WILD UNTOLD STORY OF CANNON FILMS further demonstrates this point. Harley expertly weaves together clips from Cannon's back catalog with an impressive array of interviews with Cannon players such as Albert Pyun, Boaz Davidson, Cassandra Peterson (Elvira), Bo Derek and Michael Dudikoff. The result is a whiplash-inducing ride through decades of exploitation cinema and high-rolling business deals. ELECTRIC BOOGALOO is an exciting and irreverent homage to a pair of the greatest businessmen that the film world has ever known. (Rodney Perkins)",
    "year": 2014,
    "directors": [
        "Mark Hartley"
    ],
    "title": "ELECTRIC BOOGALOO: THE WILD, UNTOLD STORY OF CANNON FILMS",
    "country": "Australia"
}