{
    "title": "ORCE MAJEURE (TURIST)",
    "raw_body": "Brief Summary\n\n\tAn upper middle-class family’s fragile existence is torn apart when a near tragedy occurs during a ski vacation and the two parents are forced confront the reality of each other’s reactions.\n\nFull Description\n\n\tThe term force majeure refers to a chance occurrence that can change everything. It is a clause that is put into contracts that frees both parties of responsibility, an unavoidable accident, or, quite simply an act of God.\n\n\tIn a remote ski resort full of rich tourists in the French Alps, an unsuspecting Swedish family is about to come up against such an event. While sitting at lunch one day, they notice an avalanche beginning to roll down the side of a nearby mountain. Responding with his first instinct, Tomas, the father of the group, flees the table, leaving his wife and children to fend for themselves. After assessing that no bodily damage has been done, the family tries to go on enjoying their holiday, but it is not long before they are having awkward dinner conversations with strangers and strained interactions about the way they separately perceive how events played out.\n\n\tCoupling intelligence with aesthetics, director Ruben Östlund presents a biting satire of masculinity. Peppered with surrealist sequences, the atmospheric film uses the imposing landscape to build images of a white abyss that one can lose themself in while the blasting Vivaldi score is reminiscent of the most powerful sequences in films like Lars von Trier’s Melancholia.\n\n\tWhile not strictly a genre movie, Force Majeure deals with something much more real and horrifying. Östlund, who has made a career for himself out of cinematic morality tales, applies his scathing wit to these scenarios and creates a kind of psychological nightmare for his characters, one in which the humor and pain of their world’s unraveling is so palpable that it is cringe inducing to watch, but the results are far too relatable to look away. Complex, powerful, hilarious and unsettling, Force Majeure is one of those films that is just simply too fantastic for us not to bring it to you. (Michael Lerman)"
}