{
    "runtime": 100,
    "raw_body": "Brief Summary\n\n\tThe anarchic and unruly history of 2000AD: the Galaxy's Greatest Comic.\n\nFull Description\n\n\tFUTURE SHOCK! tells the story of 2000AD: a UK science-fiction comic that came to change the face of the comics industry. First published in 1977 to cash in on the success of STAR WARS, 2000AD proved wildly popular with readers, but quickly forged its own distinct identity, light years away from the clear-cut heroes and villains of George Lucas' space operatics. The comic was violent, edgy, anti-authoritarian, blackly funny and above all, idiosyncratically British. Not only did it introduce seminal creators such as Alan Moore and Grant Morrison, it also had a profound influence on pop culture at large, with such cult cinema hits as ROBOCOP and HARDWARE paying overt homage to it soon after its initial publication.\n\n\tThe comprehensive documentary account of how the comic came to be, how it survived for 36 years, and how it continues to be an innovator and game-changer, FUTURE SHOCK! offers an illuminating overview of the magazine's history: a warts and all look at the various highs and lows, a peek inside the creative process of some of its most notable creators, and a funny, moving and passionate chronicle of how a disparate band of talented eccentrics came together to create something both visionary and extraordinary.\n\n\tFeaturing interviews with legendary fan-favourites such as Neil Gaiman and Grant Morrison, plus dynamic visual sequences that pay tribute to the groundbreaking artwork published in the comic throughout the years, this is the exhaustive final word on 2000AD. The scrappy upstart that is all too often overlooked amongst the constant waves of Marvel/DC corporate hype, 2000AD is more vital than either of them – independent, cutting edge and still punk after all these years. FUTURE SHOCK! aims to finally give the comic its due.",
    "year": 2014,
    "directors": [
        "Paul Goodwin"
    ],
    "title": "UTURE SHOCK! THE STORY OF 2000AD",
    "country": "United Kingdom"
}