{
    "runtime": 89,
    "raw_body": "Brief Summary\n\n\tA stunning exploration of a young woman’s nightmares.\n\nFull Description\n\n\tJessica (Lilly-Fleur Pointeaux) is a young woman plagued by nightmares. In order to better understand her plight, she studies lucid dreaming techniques. Jessica returns home to attend her grandmother’s funeral. Her mother (legendary Euro-horror stalwart Catriona MacColl) decides to hold the wake in the house and forces Jessica to sleep next door to her grandmother’s body. While staying in the house, Jessica’s nightmares become worse. Grotesque repeated imagery of family members begins to appear in her dreams. She decides to apply her knowledge of lucid dreaming to find the source of the horrible visions.\n\n\tRomain Basset’s feature-length debut is a visually stunning and highly original horror film. There are obvious precedents—Fulci and Argento immediately come to mind—but HORSEHEAD (FIEVRE) is neither an homage nor replication of a previous style. The film is structured around the contrast between everyday reality and the horrors of nightmares. There’s a compelling and clearly defined story that effortlessly switches between the real and the surreal without becoming abstract or incoherent. Totally unique and still mindful of the earlier attempts within the genre, HORSEHEAD combines a dream logic with the still logic of reality in a mindwarp which, without confusing the viewer, still serves as one hell of a trip. It’s a story told clearly, working with the use of powerful imagery as well as terrific set pieces which heighten the tension and create a highly-charged environment; the sort of film whose lucid approach enchants and delights in equal measure.\n\n\tHORSEHEAD is an extremely risky concept that is executed with confidence and skill. It’s an amazing achievement that demands attention from the opening scene to the final frame. (Rodney Perkins)",
    "year": 2014,
    "directors": [
        "Romain Basset"
    ],
    "title": "Horsehead (Fievre)",
    "country": "France"
}