{
    "runtime": 107,
    "raw_body": "Brief Summary\n\n\tAfter an innocent sexual encounter with her boyfriend, a teenager is stalked by an increasingly evil force in the year’s smartest and scariest horror film.\n\nFull Description\n\n\tThe less you know about IT FOLLOWS, the better. You should know its borrows from the best—Spielberg’s JAWS, Carpenter’s HALLOWEEN, Nakata’s RINGU, Cronenberg’s THEY CAME FROM WITHIN—but like all good lendees, it takes what it borrows and builds something entirely new.\n\n\tHere you have a teenager, Jay (Maika Monroe following up her performance in another of 2014’s great genre films, THE GUEST), who’s being relentlessly pursued by the absolute definition of irresistible force. No one but Jay can see the force, but it’s evil, patient, deadly, and can’t be killed. No one knows what the force is, where it came from, or what its motives are. You really don’t need to. You just need to know you’ll spend most of the film scanning the screen, nervously trying to spot where it might next attack both Jay and your nerves.\n\n\tAfter director David Robert Mitchell’s 2010 debut THE MYTH OF THE AMERICAN SLEEPOVER was met with widespread acclaim, one wouldn't think a horror film would be his next move. But after watching IT FOLLOWS, it’s easy to see the connections. Both take place in upper-middle class Detroit suburbs, and focus on the angst and fading innocence of its youth. Both films could easily exist in the 1980s: SLEEPOVER with its John Hughes influences, while IT FOLLOWS feels right at home with the aforementioned HALLOWEEN, showcasing wonderful photography by Michael Gioulakis and maybe the year’s best soundtrack, courtesy of Disasterpeace (Rich Vreeland). Mitchell has proved he’s a smart filmmaker that can take tender and sensitive observations about growing up and layer in a narrative that will leave horror fans buzzing for years. (James Shapiro)",
    "year": 2015,
    "directors": [
        "David Robert Mitchell"
    ],
    "title": "It Follow",
    "country": "United States"
}