{
    "title": "KID POWER! BOOK LAUNCH and screening of BUGSY MALONE",
    "raw_body": "Brief Summary\n\n\tFantastic Fest is proud to host the US Premiere launch of Spectacular Optical’s first anthology book, KID POWER! — all about cool, tuff and inspiring kids in cult film and television! Co-edited by Kier-La Janisse and Canuxploitation’s Paul Corupe and featuring writing by a diverse array of genre film criticism’s most unique voices (including Fantastic Fest’s own Zack Carlson), Kid Power! covers the gamut from THE PEANUT BUTTER SOLUTION to THE ABC AFTERSCHOOL SPECIAL and the dark side of Disney. And tons more! The launch will be accompanied by a rare 35mm screening of BUGSY MALONE (1976) and selected short films... plus a real PIE FIGHT!\n\nFull Description\n\n\tReady to get splurged? Celebrate the release of Spectacular Optical’s debut anthology Kid Power with an offbeat slapstick gangster musical that features ruthless mobsters, gin hall singers and hard-nosed cops… played exclusively by a cast of children. Alan Parker’s BUGSY MALONE showcases the talents of a pre-Chachi Scott Baio and 13-year-old Jodie Foster in perhaps the most elaborate playground game of cops and robbers ever attempted. In the film, Baio, playing the titular role, gets mixed up with one of the pint-sized gangs competing to take over the “sarsaparilla racket” by uncovering a cache of the ultimate weapon: tommy-gun like “splurge guns” that—instead of spraying bullets—shoot forth globs of custard that take their recipient out of commission. But what starts as a novelty soon gives way to a genuinely interesting story, supported ably by the pre-teen cast and a sprinkling of Broadway-style song and dance numbers written (and sometimes performed) by Paul Williams. Goofing on the clichés of prohibition-era set gangster pics like THE STING, DILLINGER and Robert Altman’s THIEVES LIKE US, the film plays off of the absurdity of miniature mobsters talking up dancers at speakeasies and chasing each other in Model T pedal cars. More importantly, BUGSY MALONE also exemplifies the idea of kid power, as the film’s small stars get the chance to resolve their own issues in a world without parents or adult authority—especially once the story explodes in delicious, creamy warfare. (Paul Corupe)\n\n\tPLUS! True to the nature of the book—which focuses on films wherein kids often have to navigate independently through frightening or “adult” situations—we’ve added a duo of short films that aren’t quite “made for children,” although they do involve young, misunderstood protagonists who lash out at an uncaring world! (Kier-la Janisse)"
}