{
    "title": "No Man’s Land",
    "raw_body": "Brief Summary\n\n\tA city lawyer fights for his life in the cutthroat deserts of contemporary China in Ning Hao's Coen-esque follow-up to CRAZY RACER, which was banned for four years.\n\nFull Description\n\n\tWhen a cocksure lawyer heads into the badlands of China's Xinjiang province, hoping a pro bono case will win him fame and acclaim, he sets into motion a series of unfortunate events that expose the harsh realities of life in the next world superpower. Writer-director Ning Hao made a splash at Fantastic Fest V with his labyrinthine crime caper CRAZY RACER, but this unflinching, darkly comic follow-up exposes his homeland as an amoral wasteland populated by hookers, crooks and con artists looking to make a quick buck. It's little wonder the Chinese censors balked at Ning's too-honest portrayal and it went unreleased for four long years.\n\n\tLeaving his cushy job in the city to defend a falcon poacher accused of murdering a cop, lawyer Pan Xiao (Xu Zheng) soon finds himself marooned in a dustbowl wilderness. Faced with trouble-making truck drivers, swindling rest stop owners, petty cops, a sultry prostitute and even the poacher's backstabbing accomplice (CRAZY RACER star Huang Bo), Pan is soon fighting for his life on an absurd odyssey through the Chinese outback.\n\n\tNing Hao's unforgiving depiction of life in mainland China plays out like a Coen Brothers reimagining of Jia Xiangke's A TOUCH OF SIN, painting a world in which only the ruthless survive, where law enforcement is impotent, money talks and human life is held in staggeringly low regard. So basically, the new economic behemoth that is China today, in all its no-frills glory. Ning assembles a fine cast of long-term collaborators who bring a fantastic energy and comedic sensibility to the otherwise brutal subject matter, while the desert vistas are shot in almost Fordian reverence, reminding us time and again how barren and devoid of morality the country has become.(James Marsh)"
}