{
    "runtime": 100,
    "raw_body": "Brief Summary\n\n\tNacho Vigalondo’s latest is a completely unique and endlessly creative thriller for the internet age, taking place entirely on a single computer desktop.\n\nFull Description\n\n\tElijah Wood is Nick Chambers, admin of the Jill Goddard (Sasha Grey) fan site and all-around internet nerd. In Austin live-streaming a Q&A after a screening of Jill’s latest film (taking place in Fantastic’s Fest home at the Alamo Drafthouse South Lamar), he’s the winner of a contest that will afford him the opportunity to have dinner with the object of his obsession. His hopes are dashed when a stranger named Chord calls to inform him that Jill has had to cancel. But then, in a strange and convincing display of his powers, Chord turns Nick’s computer into the ultimate Jill Goddard spy machine, hacking cameras at the theater and even her cellphone, and allowing Nick an all-access pass into the star’s life. Before long, it becomes apparent that Nick is trapped in some sort of sick game and Jill may be in danger.\n\n\tTaking place entirely on Nick’s computer screen—the action jumping from window to window on the desktop—OPEN WINDOWS embodies everything we love about director Nacho Vigalondo’s wild imagination. From his award-winning shorts to TIMECRIMES to EXTRATERRESTRIAL and beyond, Nacho consistently displays a knack for inventive plot devices that transform the mundane into the extraordinary, throwing his stories’ characters into the most thrilling of circumstances. To that effect, OPEN WINDOWS is his most ambitious project yet.\n\n\tYou’ll hear names like Hitchcock and DePalma thrown around in discussions about OPEN WINDOWS. Make no mistake; while such influences may be evident, what you’re left with after they’re processed through the wit and insanity of the man’s brain makes OPEN WINDOWS pure Vigalondo. (Brian Kelley)\n\n\t ",
    "year": 2013,
    "directors": [
        "Nacho Vigalondo"
    ],
    "title": "Open Window",
    "country": "Spain"
}