{
    "title": "The Trib",
    "raw_body": "Brief Summary\n\n\tWinner of the three major awards at this year’s Cannes’ Critics Week, THE TRIBE follows deaf student Sergey’s transfer to a new school, which sends him down a path of ruthless crime and forbidden love.\n\nFull Description\n\n\tLet’s get the hyperbole out of the way first: THE TRIBE is a remarkable cinematic accomplishment from a first time filmmaker and a non-professional cast. If you consider yourself a fan of film, you simply must see it. There’s nothing else like this.\n\n\n\tWhy? Because the dialogue is entirely done in sign language with no translation or subtitles. And it’s fucking amazing. Imagine feeling a movie for two plus hours. That’s what THE TRIBE asks its audience to do and it’s a profound and deeply moving experience.\n\n\n\tAt its heart, THE TRIBE is a love story between newly transferred Sergey and fellow student Anna. Their school is basically a front for corrupt teachers who recruit their students to engage in theft and prostitution. Sergey quickly get drawn into the life of crime, and as he works his way up the rigid hierarchy, he starts pimping out female students. One is Anna, who isn’t just a prostitute, but a concubine for the school’s top criminals. Sergey is given a night with Anna as a reward and they fall for each other. That’s a violation of the gang’s rigid code and the two quickly find their lives in mortal danger.\n\n\n\tDirector Myroslav Slaboshpytskiy was attempting to create a pure cinematic expression that reminded one of the silent film days, and his debut feature succeeds so well that it’s impossible to dismiss it as a gimmick. The film succeeds not just because of the lack of subtitles, but because seemingly every element here is exceptional, from the composition and photography to the production design to the incredibly brave acting, especially by female lead Yana Novikova. Her performance is spirited, passionate and raw. At Cannes, she was given a standing ovation. As she rose to acknowledge the applause, one became aware she couldn’t hear the accolades, but she could feel it and was overwhelmed with emotion. It’s the same sensation you’ll feel while watching this movie. (James Shapiro)"
}