{
    "runtime": 102,
    "raw_body": "Brief Summary\n\n\tA one-handed film editor finds himself the prime suspect after a series of violent murders start happening around him in this knowing tribute to giallo from the crazy minds at Astron-6!\n\nFull Description\n\n\tRey Ciso (Adam Brooks) was once the greatest editor of his time, but a freak accident has left him with four wooden fingers, and he now spends his days working on cheap and lurid pulp films. When the cast and crew of his most recent project start turning up dead, Rey becomes the prime suspect and can only rely on himself to prove his innocence. Unfortunately, even Rey is not sure whether he’s the killer or not…\n\n\tFrom the fantastic team behind FATHER’S DAY and MANBORG now comes perhaps the most loving tribute to giallo films of the 1970s. THE EDITOR is a distillation of the best and the most sublimely ridiculous bits of the genre in one hilarious, visually stunning, politically incorrect and violent whole. It’s packed with genre favorite actors including Udo Kier, Laurence Harvey, Tristran Risk and Paz De La Huerta.\n\n\tTHE EDITOR is an unbelievably heartfelt satire of the giallos of the 1970s. From the exquisite period look to the extraordinary attention paid to characters, the film serves as both love letter and delicate ridicule.\n\n\tHelping to complete the experience is a stunning score put together by some very talented composers as well as one or two maestros of the original period. The soundtrack is a glorious, over-the-top accomplishment which serves to highlight the action like no other.\n\n\tLet us also not forget the gross, brilliant murder sequences which comprise the backbone of any giallo; long, drawn-out affairs always predisposed towards the ridiculous. THE EDITOR does not disappoint with its choice of weaponry or inventiveness.\n\n\tFrom its opening shot until the gloriously demented finale, THE EDITOR is one mad ride that no festival-goer will want to miss! (Evrim Ersoy)",
    "year": 2014,
    "directors": [
        "Adam Brooks",
        "Matt Kennedy"
    ],
    "title": "The Editor",
    "country": "Canada"
}