{
    "title": "The Babadook",
    "raw_body": "Brief Summary\n\n\tIn this impressive horror debut, Amelia thought her biggest problems were her son’s violent behavioral problems and her own depression. That was before something came knocking at the door…\n\nFull Description\n\n\tAmelia (Essie Davis) has a problem and he is Sam (Noah Wiseman), her son. As his seventh birthday approaches—a day she is unable to celebrate because it happens to be the anniversary of her husband’s death. Sam’s behavioral problems cause issues with friends and family, leading Amelia to lose more and more sleep. Drifting through a hazy life fighting off grief, guilt and her own flesh and blood, Amelia’s motherly instincts are nearly shredded before one night’s bedtime story comes in the form of a mysterious and gruesomely detailed pop-up book called “Mr. Babadook.” Adding to his already violent outbursts is a new obsessive fear of the titular Babadook, and Sam comes dangerously close to pushing his mother to her breaking point before a knock-knock-knock at the door means the pair might have something more sinister to battle than each other.\n\n\tExpanding her short film MONSTER into her debut feature, Jennifer Kent explodes onto the horror scene with a film that oozes confidence. Her script and direction, the wickedly clever editing, the brilliant production and sound design and, not least of all, the two pitch-perfect central performances by Davis and Wiseman combine to deliver a horror experience nobody will soon forget. This twisted fairy tale never takes the easy way out, cheap shocks are not substituted for carefully built atmosphere, no tension is weakened by unnecessary comic relief and the special effects are a wonderful mix of old school techniques. It also never forgets the human drama at its very core.\n\n\tTHE BABADOOK is incredibly effective because it puts its audience in a truly gripping emotional stronghold. That... and it’s scary as shit. (Brian Kelley)"
}