{
    "title": "The Absent O",
    "raw_body": "Brief Summary\n\n\tPolice investigators dig into the facts of a twenty year old double homicide in a desperate race to find a likely witness before the killers have the chance to silence her forever.\n\nFull Description\n\n\tIt’s been twenty years since young twins were discovered slain in a remote community. It was a brutal crime that pointed to students at a nearby boarding school for the extreme upper crust until an outsider stepped forward to confess and the whole thing was just swept away. Twenty years also since Kimmie, a young woman who left a frantic message to the police about the crime, also disappeared. It’s too unlikely to be a coincidence, and when the case file crosses the desk of detective Carl Morck (the fabulous Nikolaj Lie Kaas), it plunges him into a decades-old cover-up and into direct conflict with the powerful elite.\n\n\tIt was back in 2010 that director Mikkel Norgaard launched an all out assault on the Danish box office with outrageous comedy KLOWN—the film that proved a monstrous hit here at Fantastic Fest while breaking stacks of box office records in its home country. In the aftermath of KLOWN, the safe thing for Norgaard to do would be to stick with comedy, but instead he took a hard left turn into the world of crime literature with THE KEEPER OF LOST CAUSES—the first of Jussi Adler Olsen’s hugely popular Department Q series of cold case crime novels—and set the box office on fire again. This time he followed up with the “safe” thing and moved on to book two for his next project.\n\n\tYet another high point in what seems to be a neverending string of high quality crime offerings out of Scandinavia, the Department Q novels have won a loyal following around the globe amongst fans of Jo Nesbo and Steig Larsson for the simple reason that they’re very, very good; loaded with complex characters and compelling mysteries while Norgaard and his cast have proven a perfect match to the source material. Fans of THE KILLING, THE BRIDGE and THE GIRL WITH THE DRAGON TATTOO, take note. Here comes your new favorite thing. (Todd Brown)"
}