{
    "title": "Tommy (TommyMer)",
    "raw_body": "Brief Summary\n\n\tTommy is coming home, or at least that’s what his wife Estelle desperately needs people to believe when she returns after a year in exile. And if he doesn’t get what’s his, there’s going to be hell to pay.\n\nFull Description\n\n\tTommy is coming home. He’s been gone for a year now—hiding out, living in exile with his wife and young daughter in Sri Lanka after a job gone wrong—but now he’s coming home. And if he doesn’t get what’s his; if the people who crossed him don’t make it right… well, then there’s going to be hell to pay. Or at least that’s the message delivered by Tommy’s wife Estelle when she lands in Stockholm with the pair’s young daughter in tow. Tommy himself is mysteriously not to be found.\n\n\tA very different sort of crime film, METROPIA director Tarik Saleh returns to Fantastic Fest with TOMMY. It’s not just the story of the woman behind the man, but of the women—three generations in all—and each of them determined to get what’s theirs by any means necessary.\n\n\tWhere most gangster films end with the job in question (whether it goes right or wrong), Saleh instead unravels his web long after the fact. The actual job is now long past, with the players involved firmly entrenched in their deceits while those around them struggle to cope with the consequences and carve out a livable space for themselves. Saleh ratchets up the tension, not so much with fire power as with the threat of raw brutality and divided loyalties where nobody—not even family—can truly be trusted. Because this is a world where everyone is ultimately out for themselves and betrayal is de rigeur.\n\n\tA sterling example of the current wave of Nordic crime noir’s ability to satisfy genre conventions while simultaneously confounding them, TOMMY is a surprising turn in a new direction from a man who was already one of Sweden’s most intriguing directors. (Todd Brown)"
}