{
    "runtime": 98,
    "raw_body": "Brief Summary\n\n\tFantastic Fest alumni Nacho Vigalondo & Marcel Sarmiento join several other genre filmmaking greats in this 3rd installment of the twisted found footage horror anthology franchise.\n\nFull Description\n\n\tEveryone loves a good horror anthology and the V/H/S series continues to feed that hunger. The latest installment expands the universe and continues a streak of terror, violence and a wicked sense of humor set forth by the previous films. VHS VIRAL brings together Fantastic Fest alumni Nacho Vigalando (TIMECRIMES) and Marcel Sarmiento (DEADGIRL) along with hot genre directors Gregg Bishop (DANCE OF THE DEAD) and Justin Benson and Aaron Moorhead (RESOLUTION). With titles like “Bonestorm”, “Dante the Great” and “Parallel Monsters”, there is something here for every kind of horror fan.\n\n\tAs a mysterious ice cream truck wreaks havoc on the streets, running down cops and dragging kids to their deaths, teenagers are finding themselves become part of an increasingly chaotic and sinister online phenomenon. And that’s just the wraparound story. The VHS VIRAL tales, all featuring inventive uses of the found footage style the series is built upon, jump from a peculiar magician to a garage scientist’s bizarre discovery to a rowdy bunch of skateboarders who screw around with the wrong local legend with expectedly bloody results. With three films under its belt, the V/H/S series has made itself into a horror anthology fan’s most twisted dream-come-true. (Brian Kelley)\n\n\tAdditional Credits:\n\tGreg Gilreath (Segment Production Manager)\n\tNick Blanco (Segment Actor)\n\tShane Brady (Segment Actor)\n\tAdam Henricks (Segment Producer)\n\tJohn Lang (Segment Producer)\n\tChase Newton (Segment Actor)\n\tDavid Lawson (Segment Producer)\n\tRyan Leonard (Segment Production Manager) \n\tGeorge Feucht (Segment Director of Photography)\n\tNahikari Ipiña (Segment Producer)",
    "year": 2014,
    "directors": [
        "Marcel Sarmiento",
        "Nacho Vigalondo",
        "Justin Benson",
        "Aaron Moorhead",
        "Gregg Bishop"
    ],
    "title": "V/H/S Viral",
    "country": "United States"
}