{
    "runtime": 81,
    "raw_body": "Brief Summary\n\n\tIn an isolated Danish fishing town, 16-year-old Marie hides a terrifying secret and deadly consequences for the unwary in this unique coming-of-age story from director Jonas Alexander Arnby.\n\nFull Description\n\n\tIn an isolated town on the west coast of Denmark lives 16-year-old Marie, with her almost-catatonic mother and her nervous, caring father. At first glance, Marie’s life is familiar: growing pains, a new job, and a fledgling romance all point to the world of a typical teenager. However, under the surface lies a secret so dark that it threatens to upset the existence of her family and the entire town.\n\n\tFrom director Jonas Alexander Arnby comes the most unusual coming-of-age story of the year. Part LET THE RIGHT ONE IN and part tone poem, WHEN ANIMALS DREAM is a haunting elegy to growing up and independence. Resolutely unique and powerfully quiet, the film is blessed with standout performances from Sonia Suhl, Sonja Richter and genre favorite Lars Mikkelsen, as well as a beautiful and unforgettable soundtrack. Using the isolation of its setting to his advantage, director Arnby creates an eerie atmosphere tense with judgement and paranoia. Like a reverse exploration of the original Universal monster, the villagers within this sparse settlement serve as judgemental obstacles as opposed to wide-eyed and innocent keepers of a dark secret.\n\n\tWith two strong female leads at hand, Arnby explores sexuality and coming-of-age in a universal language. It’s not just the small-town mentality of the population which keep the women ensnared; it’s also the acceptance of their own body and being which may lead to more trouble than they could ever expect. Eschewing violence in favor of confrontational reality, Arnby still creates a fearless film which can be as visceral as any before it.\n\n\tDefying the in-your-face tactics of usual genre fare in favor of understated brilliance, this film leaves a mark that will be impossible to forget. (Evrim Ersoy)",
    "year": 2015,
    "directors": [
        "Jonas Alexander Arnby"
    ],
    "title": "When Animals Dream",
    "country": "Denmark"
}